[
    {
        "ticker": "AAPL",
        "name": "Apple Inc.",
        "description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.",
        "industry": "Consumer Electronics",
        "sector": "Technology",
        "djia": false,
        "sp500": false,
        "market_capitalization": 3576343560192,
        "basic_eps": 6.09,
        "diluted_eps": -1.0,
        "dividend_yield": 0.43,
        "free_cash_flow": 110846001152,
        "net_income": 93736001536,
        "pe_ratio": 39.05,
        "ps_ratio": 9.15,
        "profit_margin": 23.97,
        "revenues": 391034994688,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "TSLA",
        "name": "Tesla, Inc.",
        "description": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive; and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners. This segment also provides services and repairs to its energy product customers, including under warranty; and various financing options to its residential customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.",
        "industry": "Auto Manufacturers",
        "sector": "Consumer Cyclical",
        "djia": false,
        "sp500": false,
        "market_capitalization": 1149294739456,
        "basic_eps": 2.03,
        "diluted_eps": -1.0,
        "dividend_yield": 0.0,
        "free_cash_flow": -826875008,
        "net_income": 7129999872,
        "pe_ratio": 176.01,
        "ps_ratio": 11.76,
        "profit_margin": 7.26,
        "revenues": 97690001408,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "WTMA",
        "name": "Welsbach Technology Metals Acquisition Corp.",
        "description": "Welsbach Technology Metals Acquisition Corp. does not have significant operations. The company intends to effect a merger, stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. It intends to focus on the technology metals and energy transition metals markets. Welsbach Technology Metals Acquisition Corp. was incorporated in 2021 and is based in Lombard, Illinois.",
        "industry": "Shell Companies",
        "sector": "Financial Services",
        "djia": false,
        "sp500": false,
        "market_capitalization": 37876048,
        "basic_eps": -0.06,
        "diluted_eps": -1.0,
        "dividend_yield": 0.0,
        "free_cash_flow": 11829396,
        "net_income": -16081,
        "pe_ratio": 0.0,
        "ps_ratio": 0.0,
        "profit_margin": 0.0,
        "revenues": -1,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "MSFT",
        "name": "Microsoft Corporation",
        "description": "Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.",
        "industry": "Software - Infrastructure",
        "sector": "Technology",
        "djia": false,
        "sp500": false,
        "market_capitalization": 3319748362240,
        "basic_eps": 12.11,
        "diluted_eps": -1.0,
        "dividend_yield": 0.75,
        "free_cash_flow": 61280874496,
        "net_income": 90511998976,
        "pe_ratio": 36.87,
        "ps_ratio": 13.06,
        "profit_margin": 35.61,
        "revenues": 254189993984,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "XOM",
        "name": "Exxon Mobil Corporation",
        "description": "Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. It sells its products under the Exxon, Esso, and Mobil brands. The Chemical Products segment manufactures and markets petrochemicals including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company also involves in the manufacturing, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit lower-emission business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Exxon Mobil Corporation was founded in 1870 and is based in Spring, Texas.",
        "industry": "Oil & Gas Integrated",
        "sector": "Energy",
        "djia": false,
        "sp500": false,
        "market_capitalization": 477482582016,
        "basic_eps": 8.02,
        "diluted_eps": -1.0,
        "dividend_yield": 3.57,
        "free_cash_flow": 28811499520,
        "net_income": 33699999744,
        "pe_ratio": 13.55,
        "ps_ratio": 1.39,
        "profit_margin": 9.8,
        "revenues": 343818010624,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "MCD",
        "name": "McDonald's Corporation",
        "description": "McDonald's Corporation operates and franchises restaurants under the McDonald's brand in the United States and internationally. It offers food and beverages, including hamburgers and cheeseburgers, various chicken sandwiches, fries, shakes, desserts, sundaes, cookies, pies, soft drinks, coffee, and other beverages; and full or limited breakfast, as well as sells various other products during limited-time promotions. The company owns and operates under various structures comprising conventional franchise, developmental license, or affiliate. McDonald's Corporation was founded in 1940 and is based in Chicago, Illinois.",
        "industry": "Restaurants",
        "sector": "Consumer Cyclical",
        "djia": false,
        "sp500": false,
        "market_capitalization": 216136187904,
        "basic_eps": 11.39,
        "diluted_eps": -1.0,
        "dividend_yield": 2.37,
        "free_cash_flow": 7300262400,
        "net_income": 8245799936,
        "pe_ratio": 26.48,
        "ps_ratio": 8.33,
        "profit_margin": 31.79,
        "revenues": 25938700288,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "AMZN",
        "name": "Amazon.com, Inc.",
        "description": "Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, fire tablets, fire TVs, echo, ring, blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.",
        "industry": "Internet Retail",
        "sector": "Consumer Cyclical",
        "djia": false,
        "sp500": false,
        "market_capitalization": 2389304410112,
        "basic_eps": 5.53,
        "diluted_eps": -1.0,
        "dividend_yield": 0.0,
        "free_cash_flow": 44635873280,
        "net_income": 59248001024,
        "pe_ratio": 40.77,
        "ps_ratio": 3.75,
        "profit_margin": 9.29,
        "revenues": 637959012352,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "DJIA",
        "name": "Global X Dow 30 Covered Call ETF",
        "description": "The index measures the performance of a covered call strategy that holds a theoretical portfolio of the underlying stocks of the Dow Jones Industrial Average® (the \"reference index\") and \"writes\" (or sells) a succession of one-month at-the-money (“ATM”) covered call options on the Reference Index. The fund invests in the securities reflected in the index, and cannot invest directly in the index itself. The fund is non-diversified.",
        "industry": "",
        "sector": "",
        "djia": false,
        "sp500": false,
        "market_capitalization": -1,
        "basic_eps": -1.0,
        "diluted_eps": -1.0,
        "dividend_yield": 0.0,
        "free_cash_flow": -1,
        "net_income": -1,
        "pe_ratio": 21.44,
        "ps_ratio": 0.0,
        "profit_margin": 0.0,
        "revenues": -1,
        "total_equity": 99340176,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "AY",
        "name": "Atlantica Sustainable Infrastructure plc",
        "description": "Atlantica Sustainable Infrastructure plc owns, manages, and invests in renewable energy, storage, natural gas and heat, electric transmission lines, and water assets in North America, South America, Europe, the Middle East, and Africa. The company was formerly known as Atlantica Yield plc and changed its name to Atlantica Sustainable Infrastructure plc in May 2020. Atlantica Sustainable Infrastructure plc was incorporated in 2013 and is based in Brentford, the United Kingdom.",
        "industry": "Utilities - Renewable",
        "sector": "Utilities",
        "djia": false,
        "sp500": false,
        "market_capitalization": 2554601472,
        "basic_eps": 0.25,
        "diluted_eps": -1.0,
        "dividend_yield": 8.05,
        "free_cash_flow": 3068375,
        "net_income": 34752000,
        "pe_ratio": 87.96,
        "ps_ratio": 2.25,
        "profit_margin": 3.06,
        "revenues": 1134386944,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "VTVT",
        "name": "vTv Therapeutics Inc.",
        "description": "vTv Therapeutics Inc., a clinical stage biopharmaceutical company, focuses on the development of orally administered treatments for metabolic and inflammatory diseases. The company's lead drug candidate is cadisegliatin (TTP399), an orally administered small molecule and liver-selective glucokinase activator that is in Phase III clinical trial for treating type 1 and type 2 diabetes; and TTP273, an orally available small molecule glucagon-like peptide 1 receptor agonists that is in Phase I clinical trial for the treatment of cystic fibrosis related diabetes, as well as in Phase II trial for the treatment of type 2 diabetes. It is also developing HPP737, an orally administered non-CNS penetrant phosphodiesterase type 4 inhibitor, which is in Phase III trial for the treatment of psoriasis, COPD, and atopic dermatitis, as well as TTP-RA, a RAGE antagonist for type 1 diabetes prevention. In addition, the company's other programs include HPP3033, a non-electrophilic therapeutic approach to activating the nuclear factor erythroid 2\u0096related factor 2 (Nrf2) pathway for the treatment of chronic diseases associated with oxidative stress; and Azeliragon, a RAGE antagonist for inflammatory lung diseases, including severe COVID-19, as well as for glioblastoma, other cancers, and cancer treatment-related conditions. vTv Therapeutics Inc. has license agreements with Reneo Pharmaceuticals, Inc. to develop and commercialize peroxisome proliferation activated receptor delta agonist program, including the compound HPP593 for therapeutic, prophylactic, and diagnostic application; and Anteris Bio, Inc. to develop and commercialize HPP971, a Nrf2 activator, as well as with Cantex Pharmaceuticals, Inc.; Hangzhou Zhongmei Huadong Pharmaceutical Co., Ltd.; Newsoara Biopharma Co., Ltd.; JDRF International; and Novo Nordisk A/S. The company was incorporated in 2015 and is headquartered in High Point, North Carolina. vTv Therapeutics Inc. is a subsidiary of MacAndrews & Forbes Group LLC.",
        "industry": "Biotechnology",
        "sector": "Healthcare",
        "djia": false,
        "sp500": false,
        "market_capitalization": 45923532,
        "basic_eps": -4.37,
        "diluted_eps": -1.0,
        "dividend_yield": 0.0,
        "free_cash_flow": -13889500,
        "net_income": -20177000,
        "pe_ratio": 0.0,
        "ps_ratio": 45.92,
        "profit_margin": 0.0,
        "revenues": 1000000,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "ICCT",
        "name": "iCoreConnect Inc.",
        "description": "iCoreConnect Inc., a cloud-based software and technology company, provides Health Insurance Portability and Accountability Act (HIPAA) compliant cloud-based software as a service (SaaS) in the United States. The company's products include iCoreRx, a HIPAA compliant electronic prescription software; iCorePDMP, a solution that checks the patient's Prescription Drug Monitoring Program (PDMP) history before prescribing controlled substances; iCoreVerify and iCoreVerify+, a HIPAA compliant SaaS solution that automatically retrieves a patients insurance eligibility breakdown to verify their benefits in advance of their appointment and on-demand; iCoreHuddle and iCoreHuddle+, a tool to instantly reveal the revenue potential of each patient; and iCoreCodeGenius, a medical coding reference SaaS solution. It also offers iCoreExchange, a SaaS email solution that allows doctors to send and receive secure email with attachments to and from other healthcare professionals; iCoreCloud, ability to backup their on-premise servers and computers to the cloud; iCoreClaims, for processing and managing claims submitted by policyholders or dental care providers; iCorePay, a patient payment processing solutions for payment and revenue cycle tracking; iCoreSecure, secure SaaS solution that solves privacy concerns in the insurance, real estate, financial and many other industry sectors; and iCoreIT, an IT managed services. The company was formerly known as iMedicor, Inc. and changed its name to iCoreConnect Inc. in June 2017. iCoreConnect Inc. was founded in 1992 and is headquartered in Ocoee, Florida.",
        "industry": "Health Information Services",
        "sector": "Healthcare",
        "djia": false,
        "sp500": false,
        "market_capitalization": 6241410,
        "basic_eps": -3.51,
        "diluted_eps": -1.0,
        "dividend_yield": 0.0,
        "free_cash_flow": 2602445,
        "net_income": -28038116,
        "pe_ratio": 0.0,
        "ps_ratio": 0.61,
        "profit_margin": -260.79,
        "revenues": 10266331,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "TLT",
        "name": "iShares 20+ Year Treasury Bond ETF",
        "description": "The fund will invest at least 80% of its assets in the component securities of the underlying index, and it will invest at least 90% of its assets in U.S. Treasury securities that the advisor believes will help the fund track the underlying index. The underlying index measures the performance of public obligations of the U.S. Treasury that have a remaining maturity greater than or equal to twenty years.",
        "industry": "",
        "sector": "",
        "djia": false,
        "sp500": false,
        "market_capitalization": -1,
        "basic_eps": -1.0,
        "diluted_eps": -1.0,
        "dividend_yield": 0.0,
        "free_cash_flow": -1,
        "net_income": -1,
        "pe_ratio": 0.0,
        "ps_ratio": 0.0,
        "profit_margin": 0.0,
        "revenues": -1,
        "total_equity": 59697242112,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "IBM",
        "name": "International Business Machines Corporation",
        "description": "International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services worldwide. The company operates through Software, Consulting, Infrastructure, and Financing segments. The Software segment offers a hybrid cloud and AI platforms that allows clients to realize their digital and AI transformations across the applications, data, and environments in which they operate. The Consulting segment focuses on skills integration for strategy, experience, technology, and operations by domain and industry. The Infrastructure segment provides on-premises and cloud based server, and storage solutions, as well as life-cycle services for hybrid cloud infrastructure deployment. The Financing segment offers client and commercial financing, facilitates IBM clients' acquisition of hardware, software, and services. The company has a strategic partnership to various companies including hyperscalers, service providers, global system integrators, and software and hardware vendors that includes Adobe, Amazon Web services, Microsoft, Oracle, Salesforce, Samsung Electronics and SAP, and others. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York.",
        "industry": "Information Technology Services",
        "sector": "Technology",
        "djia": false,
        "sp500": false,
        "market_capitalization": 201073852416,
        "basic_eps": 6.86,
        "diluted_eps": -1.0,
        "dividend_yield": 3.04,
        "free_cash_flow": 10412125184,
        "net_income": 6373000192,
        "pe_ratio": 31.7,
        "ps_ratio": 3.21,
        "profit_margin": 10.22,
        "revenues": 62579998720,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "GE",
        "name": "GE Aerospace",
        "description": "General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.",
        "industry": "Aerospace & Defense",
        "sector": "Industrials",
        "djia": false,
        "sp500": false,
        "market_capitalization": 184855150592,
        "basic_eps": 5.06,
        "diluted_eps": -1.0,
        "dividend_yield": 0.65,
        "free_cash_flow": 4729375232,
        "net_income": 5500000256,
        "pe_ratio": 33.75,
        "ps_ratio": 2.64,
        "profit_margin": 8.93,
        "revenues": 69953003520,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "COKE",
        "name": "Coca-Cola Consolidated, Inc.",
        "description": "Coca-Cola Consolidated, Inc., together with its subsidiaries, manufactures, markets, and distributes nonalcoholic beverages primarily products of The Coca-Cola Company in the United States. The company offers sparkling beverages; and still beverages, including energy products, as well as noncarbonated beverages comprising bottled water, ready to drink coffee and tea, enhanced water, juices, and sports drinks. It also sells its products to other Coca-Cola bottlers; and post-mix products that are dispensed through equipment, which mixes the fountain syrups with carbonated or still water enabling fountain retailers to sell finished products to consumers in cups or glasses. In addition, the company manufactures and distributes various other beverage brands that include Dr Pepper and Monster Energy. It sells and distributes its products directly to grocery stores, mass merchandise stores, club stores, convenience stores, and drug stores; and restaurants, schools, amusement parks, and recreational facilities, as well as through vending machine outlets. The company was formerly known as Coca-Cola Bottling Co. Consolidated and changed its name to Coca-Cola Consolidated, Inc. in January 2019. Coca-Cola Consolidated, Inc. was incorporated in 1980 and is headquartered in Charlotte, North Carolina.",
        "industry": "Beverages - Non-Alcoholic",
        "sector": "Consumer Defensive",
        "djia": false,
        "sp500": false,
        "market_capitalization": 12340205568,
        "basic_eps": 57.75,
        "diluted_eps": -1.0,
        "dividend_yield": 0.71,
        "free_cash_flow": 407303744,
        "net_income": 530012992,
        "pe_ratio": 24.39,
        "ps_ratio": 1.82,
        "profit_margin": 7.81,
        "revenues": 6784177152,
        "total_equity": -1,
        "total_liabilities": -1,
        "last_updated": "2025-02-20",
        "similarAssets": ""
    },
    {
        "ticker": "ENPH",
        "name": "Enphase Energy, Inc.",
        "description": "Enphase Energy, Inc., together with its subsidiaries, designs, develops, manufactures, and sells home energy solutions for the solar photovoltaic industry in the United States and internationally. The company offers semiconductor-based microinverter that converts energy at the individual solar module level and combines with its proprietary networking and software technologies to provide energy monitoring and control. It also provides microinverter units and related accessories; IQ Battery and related accessories; IQ Gateway and IQ Energy Router; cloud-based Enlighten monitoring service; and electric vehicle charging solutions, as well as design, proposal, permitting, and lead generation services. The company sells its solutions to solar distributors; and directly to large installers, original equipment manufacturers, strategic partners, and homeowners, as well as through its legacy product upgrade program or online store. Enphase Energy, Inc. was incorporated in 2006 and is headquartered in Fremont, California.",
        "industry": "Solar",
        "sector": "Technology",
        "djia": false,
        "sp500": false,
        "market_capitalization": 7815789056,
        "basic_eps": 0.75,
        "diluted_eps": 0.0,
        "dividend_yield": 0.0,
        "free_cash_flow": 388504128,
        "net_income": 102658000,
        "pe_ratio": 78.67,
        "ps_ratio": 5.87,
        "profit_margin": 7.72,
        "revenues": 1330382976,
        "total_equity": 0,
        "total_liabilities": 0,
        "last_updated": "2025-03-12",
        "similarAssets": "['TSLA', 'AAPL', 'AY', 'TLT', 'COKE']"
    }
]